#Область ПрограммныйИнтерфейс

// Возвращает структуру состояния MCP.
//
// Возвращаемое значение:
//  Структура - Состояние MCP.
Функция СостояниеСервера() Экспорт
	Если Мсп_Состояние = Неопределено Тогда
		Мсп_Состояние = НовыйСостояние();
	КонецЕсли;
	Возврат Мсп_Состояние;
КонецФункции

// Возвращает значение состояния по имени.
//
// Параметры:
//  Имя - Строка - Имя значения состояния.
//  ЗначениеПоУмолчанию - Произвольный, Неопределено - Значение по умолчанию.
//
// Возвращаемое значение:
//  Произвольный - Значение состояния или значение по умолчанию.
Функция ЗначениеСостоянияСервера(Имя, ЗначениеПоУмолчанию = Неопределено) Экспорт
	Состояние = СостояниеСервера();
	Если Состояние.Свойство(Имя) Тогда
		Возврат Состояние[Имя];
	КонецЕсли;
	Возврат ЗначениеПоУмолчанию;
КонецФункции

// Устанавливает значение состояния.
//
// Параметры:
//  Имя - Строка - Имя значения состояния.
//  Значение - Произвольный - Значение состояния.
Процедура УстановитьЗначениеСостоянияСервера(Имя, Значение) Экспорт
	Состояние = СостояниеСервера();
	Состояние.Вставить(Имя, Значение);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыйСостояние() Экспорт
	
	Состояние = Новый Структура;
	Состояние.Вставить("Реестры", Новый Структура);
	Состояние.Вставить("ПараметрыЛогирования", НовыйПараметрыЛогирования());
	
	Возврат Состояние;
	
КонецФункции

Функция НовыйПараметрыЛогирования() Экспорт
	
	ПараметрыЛогирования = Новый Структура("Логировать,УровеньЛога,ФайлЛога", Истина, "info", Неопределено);
	
	Возврат ПараметрыЛогирования;
	
КонецФункции
#КонецОбласти
