#Область ОписаниеПеременных
Перем Мсп_Состояние Экспорт;
#КонецОбласти

#Область ОбработчикиСобытий

&После("ОбработкаВнешнегоСобытия")
Асинх Процедура Мсп_ОбработкаВнешнегоСобытия(Источник, Событие, Данные)
	Ждать Мсп_ТранспортКлиент.ОбработатьВнешнееСобытие(Источник, Событие, Данные);
КонецПроцедуры

&После("ПриНачалеРаботыСистемы")
Процедура Мсп_ПриНачалеРаботыСистемы()
	Мсп_РеестрКлиент.ИнициализироватьРеестры();
	Мсп_ПровайдерыКлиент.ЗарегистрироватьПровайдеров();
	ОткрытьФорму("ОбщаяФорма.Мсп_УправлениеMCP");
КонецПроцедуры
#КонецОбласти
