#Область ОписаниеПеременных
Перем Мсп_Состояние Экспорт;
#КонецОбласти

#Область ОбработчикиСобытий
&После("ОбработкаВнешнегоСобытия")
Процедура Мсп_ОбработкаВнешнегоСобытия(Источник, Событие, Данные)
	Мсп_СерверКлиент.ОбработатьВнешнееСобытие(Источник, Событие, Данные);
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция Мсп_ПолучитьСостояние() Экспорт
	Если Мсп_Состояние = Неопределено Тогда
		Мсп_Состояние = Новый Структура;
	КонецЕсли;
	Возврат Мсп_Состояние;
КонецФункции

Функция Мсп_ПолучитьСостояниеЗначение(Имя, ЗначениеПоУмолчанию = Неопределено) Экспорт
	Состояние = Мсп_ПолучитьСостояние();
	Если Состояние.Свойство(Имя) Тогда
		Возврат Состояние[Имя];
	КонецЕсли;
	Возврат ЗначениеПоУмолчанию;
КонецФункции

Процедура Мсп_УстановитьСостояниеЗначение(Имя, Значение) Экспорт
	Состояние = Мсп_ПолучитьСостояние();
	Состояние.Вставить(Имя, Значение);
КонецПроцедуры
#КонецОбласти
