#Область ОписаниеПеременных
Перем Мсп_Состояние Экспорт;
#КонецОбласти

#Область ОбработчикиСобытий

&После("ОбработкаВнешнегоСобытия")
Процедура Мсп_ОбработкаВнешнегоСобытия(Источник, Событие, Данные)
	
	Мсп_ТранспортСобытияКлиент.ОбработатьВнешнееСобытие(Источник, Событие, Данные);
	
КонецПроцедуры

&После("ПриНачалеРаботыСистемы")
Асинх Процедура Мсп_ПриНачалеРаботыСистемы()
	
	Мсп_Сервер.Инициализировать();
	Ждать Мсп_ПараметрыЗапускаКлиент.ЗапуститьИзПараметраЗапуска(ПараметрЗапуска);
	
КонецПроцедуры
#КонецОбласти
