#Область ПрограммныйИнтерфейс

// Регистрирует провайдеров MCP из подсистемы Мсп_Провайдеры.
Процедура ЗарегистрироватьПровайдеров() Экспорт
	ОписаниеПровайдеров = Мсп_МетаданныеСервер.Провайдеры();
	
	Для Каждого ОписаниеПровайдера Из ОписаниеПровайдеров Цикл
		ЗарегистрироватьПровайдера(ОписаниеПровайдера);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗарегистрироватьПровайдера(ОписаниеПровайдера) Экспорт
	
	Мсп_ЛогированиеКлиент.Информация("Регистрация провайдера %1.%2", ОписаниеПровайдера.Тип, ОписаниеПровайдера.Имя);
	МодульПровайдера = МодульПровайдера(ОписаниеПровайдера);
	Если МодульПровайдера = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Попытка
		Мсп_СостояниеКлиент.УстановитьЗначениеСостоянияСервера("РегистрацияПровайдераВыполняется", Истина);
		МодульПровайдера.Зарегистрировать(ОписаниеПровайдера.Имя);
		Мсп_СостояниеКлиент.УстановитьЗначениеСостоянияСервера("РегистрацияПровайдераВыполняется", Ложь);
		Мсп_ТранспортРеестрыКлиент.ЗапланироватьСинхронизациюРеестров();
	Исключение
		Мсп_СостояниеКлиент.УстановитьЗначениеСостоянияСервера("РегистрацияПровайдераВыполняется", Ложь);
		Мсп_ЛогированиеКлиент.Ошибка(ИнформацияОбОшибке());
	КонецПопытки;
КонецПроцедуры

Функция МодульПровайдера(ОписаниеПровайдера)
	
	Если ОписаниеПровайдера.Тип <> "ОбщийМодуль" Тогда
		Мсп_ЛогированиеКлиент.Ошибка("Провайдер с типом '%1' не поддерживается", ОписаниеПровайдера.Тип);
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		Возврат Вычислить(ОписаниеПровайдера.Имя);
	Исключение
		Мсп_ЛогированиеКлиент.Ошибка("Не удалось создать провайдер '%1' с типом '%2'",
			ОписаниеПровайдера.Имя, ОписаниеПровайдера.Тип);
	КонецПопытки;
	
	Возврат Неопределено;
КонецФункции

#КонецОбласти
