#Область ПрограммныйИнтерфейс

// Регистрирует провайдеров MCP из подсистемы Мсп_Провайдеры.
Процедура ЗарегистрироватьПровайдеров() Экспорт
	ОписаниеПровайдеров = Мсп_МетаданныеСервер.Провайдеры();
	
	Для Каждого ОписаниеПровайдера Из ОписаниеПровайдеров Цикл
		ЗарегистрироватьПровайдера(ОписаниеПровайдера);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗарегистрироватьПровайдера(ОписаниеПровайдера) Экспорт
	
	Мсп_ЛогированиеКлиент.Информация("Регистрация провайдера %1.%2", ОписаниеПровайдера.Тип, ОписаниеПровайдера.Имя);
	МодульПровайдера = МодульПровайдера(ОписаниеПровайдера);
	Если МодульПровайдера = Неопределено Тогда
		Возврат;
	КонецЕсли;

	Попытка
		МодульПровайдера.Зарегистрировать(ОписаниеПровайдера.Имя);
	Исключение
		Ошибка = ИнформацияОбОшибке();
		Если НЕ ЭтоОшибкаОтсутствующегоОпциональногоМетода(Ошибка, "Зарегистрировать") Тогда
			Мсп_ЛогированиеКлиент.Ошибка(Ошибка);
		КонецЕсли;
	КонецПопытки;
КонецПроцедуры

Функция МодульПровайдера(ОписаниеПровайдера)
	
	Если ОписаниеПровайдера.Тип <> "ОбщийМодуль" Тогда
		Мсп_ЛогированиеКлиент.Ошибка("Провайдер с типом '%1' не поддерживается", ОписаниеПровайдера.Тип);
		Возврат Неопределено;
	КонецЕсли;
	
	Попытка
		Возврат Вычислить(ОписаниеПровайдера.Имя);
	Исключение
		Мсп_ЛогированиеКлиент.Ошибка("Не удалось создать провайдер '%1' с типом '%2'",
			ОписаниеПровайдера.Имя, ОписаниеПровайдера.Тип);
	КонецПопытки;
	
	Возврат Неопределено;
КонецФункции

Функция ЭтоОшибкаОтсутствующегоОпциональногоМетода(ОписаниеОшибки, ИмяМетода)
	
	Возврат СтрНайти(ОписаниеОшибки, СтрШаблон("Метод объекта не обнаружен (%1)", ИмяМетода)) > 0
		Или СтрНайти(ОписаниеОшибки, СтрШаблон("Object method not found (%1)", ИмяМетода)) > 0;
	
КонецФункции

#КонецОбласти
