//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область ПрограммныйИнтерфейс

// Возвращает случайный город.
//
// Возвращаемое значение:
//	Строка - Случайное наименование города.
//
// Пример:
//  СлучайныйГород = ЮТПодражатель_Локация.Город();
Функция Город() Экспорт
	
	Словарь = СловарьГорода();
	
	Возврат ЮТПодражательСлужебный.СлучайноеЗначениеИзСловаря(Словарь);
	
КонецФункции

// Возвращает случайную улицу.
//
// Возвращаемое значение:
//	Строка - Случайное наименование улицы.
//
// Пример:
//  СлучайнаяУлица = ЮТПодражатель_Локация.Улица();
Функция Улица() Экспорт
	
	Словарь = СловарьУлицы();
	
	Возврат ЮТПодражательСлужебный.СлучайноеЗначениеИзСловаря(Словарь);
	
КонецФункции

// Возвращает случайную страну.
//
// Возвращаемое значение:
//	Строка - Случайное наименование страны.
//
// Пример:
//  СлучайнаяСтрана = ЮТПодражатель_Локация.Страна();
Функция Страна() Экспорт
	
	Словарь = СловарьСтраны();
	
	Возврат ЮТПодражательСлужебный.СлучайноеЗначениеИзСловаря(Словарь);
	
КонецФункции

// Возвращает случайную область/регион.
//
// Возвращаемое значение:
//	Строка - Случайное наименование области/региона.
//
// Пример:
//  СлучайнаяОбласть = ЮТПодражатель_Локация.Область();
Функция Область() Экспорт
	
	Словарь = СловарьОбласти();
	
	Возврат ЮТПодражательСлужебный.СлучайноеЗначениеИзСловаря(Словарь);
	
КонецФункции

// Возвращает случайный почтовый индекс.
// Для русской локализации генерируется 6-значный индекс.
// Для английской локализации генерируется 5-значный индекс.
//
// Возвращаемое значение:
//	Строка - Случайный почтовый индекс.
//
// Пример:
//  СлучайныйИндекс = ЮТПодражатель_Локация.Индекс();
Функция Индекс() Экспорт
	
	КодЛокализации = ЮТПодражатель.Локализация();
	
	Если КодЛокализации = "ru" Тогда
		Возврат Формат(ЮТТестовыеДанные.СлучайноеЧисло(100000, 999999), "ЧГ=");
	Иначе
		Возврат Формат(ЮТТестовыеДанные.СлучайноеЧисло(10000, 99999), "ЧГ=");
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИмяРеализации()
	Возврат "Локация";
КонецФункции

Функция СловарьГорода()
	Возврат ЮТПодражательСлужебный.Словарь(ИмяРеализации(), "Города");
КонецФункции

Функция СловарьУлицы()
	Возврат ЮТПодражательСлужебный.Словарь(ИмяРеализации(), "Улицы");
КонецФункции

Функция СловарьСтраны()
	Возврат ЮТПодражательСлужебный.Словарь(ИмяРеализации(), "Страны");
КонецФункции

Функция СловарьОбласти()
	Возврат ЮТПодражательСлужебный.Словарь(ИмяРеализации(), "Области");
КонецФункции

#КонецОбласти
