#Область ПрограммныйИнтерфейс

Функция НекорректныеПараметры(Сообщение) Экспорт
	ВызватьИсключение(Сообщение, , "INVALID_PARAMS");
КонецФункции

Функция НеНайдено(Сообщение) Экспорт
	ВызватьИсключение(Сообщение, , "NOT_FOUND");
КонецФункции

Функция Внутренняя(Ошибка, ИнформацияОбОшибке = Неопределено) Экспорт
	ВызватьИсключениеСбояВыполнения(Ошибка, ИнформацияОбОшибке);
КонецФункции

Функция ДоступЗапрещен(Сообщение) Экспорт
	ВызватьИсключение(Сообщение, , "ACTION_DENIED");
КонецФункции

Функция НеоднозначныйРезультат(Сообщение) Экспорт
	ВызватьИсключение(Сообщение, , "AMBIGUOUS_OBJECT");
КонецФункции

Функция НеГотово(Сообщение) Экспорт
	ВызватьИсключение(Сообщение, , "NOT_READY");
КонецФункции

Функция СбойВыполнения(Ошибка, ИнформацияОбОшибке = Неопределено) Экспорт
	ВызватьИсключениеСбояВыполнения(Ошибка, ИнформацияОбОшибке);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ВызватьИсключениеСбояВыполнения(Ошибка, ИнформацияОбОшибке = Неопределено)
	Строки = Новый Массив;
	
	Если ЗначениеЗаполнено(Ошибка)Тогда
		Строки.Добавить(ТекстОшибки(Ошибка));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИнформацияОбОшибке)Тогда
		Строки.Добавить(ТекстОшибки(ИнформацияОбОшибке));
	КонецЕсли;
		
	Сообщение = СтрСоединить(Строки, ". ");
	ВызватьИсключение(Сообщение, , "ACTION_FAILED", , ИнформацияОбОшибке);
КонецФункции

Функция ТекстОшибки(Сообщение)
	Если ТипЗнч(Сообщение) = Тип("ИнформацияОбОшибке") Тогда
		Возврат Сообщение.Описание;
	Иначе
		Возврат Сообщение;
	КонецЕсли;
КонецФункции

#КонецОбласти
