#Область ПрограммныйИнтерфейс

Функция НекорректныеПараметры(Сообщение) Экспорт
	Возврат НекорректныйПараметр(Сообщение);
КонецФункции

Функция НеНайдено(Сообщение) Экспорт
	Возврат НеНайден(Сообщение);
КонецФункции

Функция Внутренняя(Сообщение) Экспорт
	Возврат ОшибкаОбработки(Сообщение);
КонецФункции

Функция ДоступЗапрещен(Сообщение) Экспорт
	Возврат ДействиеНеДоступно(Сообщение);
КонецФункции

Функция СбойВыполнения(Сообщение) Экспорт
	Возврат ОшибкаОбработки(Сообщение);
КонецФункции

Функция НекорректныйПараметр(Сообщение) Экспорт
	ВызватьИсключение(Сообщение, , "INVALID_PARAMS");
КонецФункции

Функция ДействиеНеДоступно(Сообщение) Экспорт
	ВызватьИсключение(Сообщение, , "ACTION_DENIED");
КонецФункции

Функция НеНайден(Сообщение) Экспорт
	ВызватьИсключение(Сообщение, , "NOT_FOUND");
КонецФункции

Функция НеоднозначныйРезультат(Сообщение) Экспорт
	ВызватьИсключение(Сообщение, , "AMBIGUOUS_OBJECT");
КонецФункции

Функция НеГотово(Сообщение) Экспорт
	ВызватьИсключение(Сообщение, , "NOT_READY");
КонецФункции

Функция ОшибкаОбработки(Ошибка, ИнформацияОбОшибке = Неопределено) Экспорт
	Строки = Новый Массив;
	
	Если ЗначениеЗаполнено(Ошибка)Тогда
		Строки.Добавить(ТекстОшибки(Ошибка));
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ИнформацияОбОшибке)Тогда
		Строки.Добавить(ТекстОшибки(ИнформацияОбОшибке));
	КонецЕсли;
	
	Сообщение = СтрСоединить(Строки, ". ");
	ВызватьИсключение(Сообщение, , "ACTION_FAILED", , ИнформацияОбОшибке);
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстОшибки(Сообщение)
	Если ТипЗнч(Сообщение) = Тип("ИнформацияОбОшибке") Тогда
		Возврат Сообщение.Описание;
	Иначе
		Возврат Сообщение;
	КонецЕсли;
КонецФункции

#КонецОбласти
