#Область ПрограммныйИнтерфейс

Функция НовыйСхемаОбъекта(Свойства, ТребуемыеПоля = Неопределено) Экспорт
	Возврат Мсп_СхемаПараметров.НовыйСхемаОбъекта(Свойства, ТребуемыеПоля);
КонецФункции

Функция НовыйСвойствоСхемы(Тип, Описание = "") Экспорт
	Возврат Мсп_СхемаПараметров.НовыйСвойствоСхемы(Тип, Описание);
КонецФункции

Функция НовыйСвойствоСхемыСEnum(Тип, Описание, ДопустимыеЗначения) Экспорт
	Возврат Мсп_СхемаПараметров.НовыйСвойствоСхемыСEnum(Тип, Описание, ДопустимыеЗначения);
КонецФункции

#КонецОбласти
