#Область ПрограммныйИнтерфейс

Функция Провайдеры() Экспорт

	Результат = Новый Массив;

	Для Каждого Подсистема Из ПодсистемыПровайдеров() Цикл
		ДобавитьПровайдеровПодсистемы(Результат, Подсистема);
	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьПровайдеровПодсистемы(Результат, Подсистема)

	Для Каждого ОбъектМетаданных Из Подсистема.Состав Цикл
		Если Метаданные.ОбщиеМодули.Содержит(ОбъектМетаданных) Тогда
			Результат.Добавить(НовыйОписаниеПровайдера(ОбъектМетаданных.Имя, "ОбщийМодуль"));
		ИначеЕсли Метаданные.Обработки.Содержит(ОбъектМетаданных) Тогда
			Результат.Добавить(НовыйОписаниеПровайдера(ОбъектМетаданных.Имя, "Обработка"));
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Функция ПодсистемыПровайдеров()

	ИмяПодсистемы = "Мсп_Провайдеры";
	Результат = Новый Массив;
	БазоваяПодсистема = Метаданные.Подсистемы[ИмяПодсистемы];
	Если БазоваяПодсистема <> Неопределено Тогда
		Результат.Добавить(БазоваяПодсистема);
	КонецЕсли;

	Для Каждого Подсистема Из Метаданные.Подсистемы Цикл
		Если Подсистема.ВключатьВКомандныйИнтерфейс Тогда
			Продолжить;
		КонецЕсли;

		Если СтрЗаканчиваетсяНа(Подсистема.Имя, "_" + ИмяПодсистемы) Тогда
			Результат.Добавить(Подсистема);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Конструктор описания провайдера.
//
// Параметры:
//  Имя - Строка - Имя провайдера.
//  Тип - Строка - Тип провайдера (ОбщийМодуль, Обработка).
//
// Возвращаемое значение:
//  Структура - Описание провайдера:
//   * Имя - Строка - Имя провайдера.
//   * Тип - Строка - Тип провайдера.
Функция НовыйОписаниеПровайдера(Имя, Тип)
	Описание = Новый Структура;
	Описание.Вставить("Имя", Имя);
	Описание.Вставить("Тип", Тип);
	Возврат Описание;
КонецФункции

#КонецОбласти
