Функция Провайдеры() Экспорт
	
	Результат = Новый Массив;
	Подсистема = Метаданные.Подсистемы.Мсп_Провайдеры;
	
	Для Каждого ОбъектМетаданных Из Подсистема.Состав Цикл
		Если Метаданные.ОбщиеМодули.Содержит(ОбъектМетаданных) Тогда
			Результат.Добавить(ОписаниеПровайдера(ОбъектМетаданных.Имя, "ОбщийМодуль"));
		ИначеЕсли Метаданные.Обработки.Содержит(ОбъектМетаданных) Тогда
			Результат.Добавить(ОписаниеПровайдера(ОбъектМетаданных.Имя, "Обработка"));
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

Функция ОписаниеПровайдера(Имя, Тип)
	
	Возврат Новый Структура("Имя, Тип", Имя, Тип);
	
КонецФункции
