#Область ПрограммныйИнтерфейс

Функция Провайдеры() Экспорт
	
	Результат = Новый Массив;
	Подсистема = Метаданные.Подсистемы.Мсп_Провайдеры;
	
	Для Каждого ОбъектМетаданных Из Подсистема.Состав Цикл
		Если Метаданные.ОбщиеМодули.Содержит(ОбъектМетаданных) Тогда
			Результат.Добавить(НовыйОписаниеПровайдера(ОбъектМетаданных.Имя, "ОбщийМодуль"));
		ИначеЕсли Метаданные.Обработки.Содержит(ОбъектМетаданных) Тогда
			Результат.Добавить(НовыйОписаниеПровайдера(ОбъектМетаданных.Имя, "Обработка"));
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Конструктор описания провайдера.
//
// Параметры:
//  Имя - Строка - Имя провайдера.
//  Тип - Строка - Тип провайдера (ОбщийМодуль, Обработка).
//
// Возвращаемое значение:
//  Структура - Описание провайдера:
//   * Имя - Строка - Имя провайдера.
//   * Тип - Строка - Тип провайдера.
Функция НовыйОписаниеПровайдера(Имя, Тип)
	Описание = Новый Структура;
	Описание.Вставить("Имя", Имя);
	Описание.Вставить("Тип", Тип);
	Возврат Описание;
КонецФункции

#КонецОбласти
