#Область ПрограммныйИнтерфейс

// Регистрирует сценарии тестового модуля.
Процедура ИсполняемыеСценарии() Экспорт
	ЮТТесты.ДобавитьТест("СформироватьБазовыйСнимокФормыБезЗаголовка")
		.ДобавитьТест("СформироватьБазовыйСнимокФормыСЗаголовком");
КонецПроцедуры

// Проверяет базовый снимок формы без заголовка.
Процедура СформироватьБазовыйСнимокФормыБезЗаголовка() Экспорт
	Снимок = Мсп_ФормыКлиент.СформироватьБазовыйСнимокФормы();

	ЮТест.ОжидаетЧто(Снимок)
		.Свойство("type").Равно("form")
		.Свойство("children").ИмеетДлину(0);
	ЮТест.ОжидаетЧто(Снимок.Свойство("title")).Равно(Ложь, "Заголовок не должен добавляться");
КонецПроцедуры

// Проверяет базовый снимок формы с заголовком.
Процедура СформироватьБазовыйСнимокФормыСЗаголовком() Экспорт
	Снимок = Мсп_ФормыКлиент.СформироватьБазовыйСнимокФормы("Справочник");

	ЮТест.ОжидаетЧто(Снимок)
		.Свойство("type").Равно("form")
		.Свойство("title").Равно("Справочник")
		.Свойство("children").ИмеетДлину(0);
КонецПроцедуры

#КонецОбласти
