#Область ПрограммныйИнтерфейс

// Читает JSON-строку и возвращает объект.
//
// Параметры:
//  ТекстJSON - Строка - JSON-строка.
//
// Возвращаемое значение:
//  Произвольный - Прочитанный объект.
Функция ПрочитатьJSONСтроку(ТекстJSON) Экспорт
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТекстJSON);
	Возврат ПрочитатьJSON(ЧтениеJSON, Истина);
КонецФункции

// Читает JSON-строку с подстановкой значения по умолчанию при ошибке.
//
// Параметры:
//  ТекстJSON - Строка - JSON-строка.
//  ЗначениеПоУмолчанию - Произвольный, Неопределено - Значение при ошибке чтения.
//
// Возвращаемое значение:
//  Произвольный - Прочитанный объект или значение по умолчанию.
//  Неопределено - Нет значения по умолчанию или не удалось прочитать JSON.
Функция ПрочитатьJSONСтрокуБезОшибок(ТекстJSON, ЗначениеПоУмолчанию = Неопределено) Экспорт
	Попытка
		Возврат ПрочитатьJSONСтроку(ТекстJSON);
	Исключение
		Мсп_ЛогированиеКлиент.Ошибка(ИнформацияОбОшибке());
		Возврат ЗначениеПоУмолчанию;
	КонецПопытки;
КонецФункции

// Записывает объект в JSON-строку.
//
// Параметры:
//  Данные - Структура - Объект для сериализации.
//
// Возвращаемое значение:
//  Строка - JSON-представление данных.
Функция Сериализовать(Данные) Экспорт
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, Данные);
	Возврат ЗаписьJSON.Закрыть();
КонецФункции

#КонецОбласти
