#Область ПрограммныйИнтерфейс

// Возвращает активное окно тест-клиента.
//
// Возвращаемое значение:
//  Структура - Результат получения окна:
//   * Окно - ТестируемоеОкноКлиентскогоПриложения, Неопределено - Активное окно.
//   * Ошибка - Строка - Описание ошибки.
Функция ПолучитьАктивноеОкно() Экспорт
	ТестКлиент = Мсп_УправлениеТестКлиентом.ПолучитьТестКлиент();
	Если ТестКлиент = Неопределено Тогда
		Возврат НовыйРезультатПолученияОкна(Неопределено, "test client not connected");
	КонецЕсли;

	Попытка
		Окно = ТестКлиент.ПолучитьАктивноеОкно();
		Возврат НовыйРезультатПолученияОкна(Окно, "");
	Исключение
		Возврат НовыйРезультатПолученияОкна(Неопределено, ОписаниеОшибки());
	КонецПопытки;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция НовыйРезультатПолученияОкна(Окно, Ошибка)
	Возврат Новый Структура("Окно, Ошибка", Окно, Ошибка);
КонецФункции

#КонецОбласти
