#Область ПрограммныйИнтерфейс

// Получает свойство из структуры/соответствия с поддержкой значения по умолчанию.
//
// Параметры:
//  Данные - Структура - Структура или соответствие.
//  Имя - Строка - Имя свойства.
//  ЗначениеПоУмолчанию - Произвольный, Неопределено - Значение по умолчанию.
//
// Возвращаемое значение:
//  Произвольный - Значение свойства или значение по умолчанию.
//  Неопределено - Свойство не найдено и значение по умолчанию не задано.
Функция ПолучитьСвойство(Данные, Имя, ЗначениеПоУмолчанию) Экспорт
	Если ТипЗнч(Данные) = Тип("Структура") Тогда
		Значение = ЗначениеПоУмолчанию;
		Если Данные.Свойство(Имя, Значение) Тогда
			Возврат Значение;
		КонецЕсли;
	КонецЕсли;
	Если ТипЗнч(Данные) = Тип("Соответствие") Тогда
		Значение = Данные.Получить(Имя);
		Если Значение <> Неопределено Тогда
			Возврат Значение;
		КонецЕсли;
	КонецЕсли;
	Возврат ЗначениеПоУмолчанию;
КонецФункции

#КонецОбласти
