#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Мсп_Сервер.ОтменитьРегистрациюПровайдера("Демо обработка");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗарегистрироватьИнструменты(Команда)
	Мсп_Сервер.ЗарегистрироватьИнструмент(Мсп_Сервер.НовыйИнструмент(
		"Сложить",
		"Выполняет сложение",
		СхемаВходныхПараметров(),
		Новый ОписаниеОповещения("Сложить", ЭтотОбъект)),
		"Демо обработка");
	
	Мсп_Сервер.ЗарегистрироватьИнструмент(Мсп_Сервер.НовыйИнструмент(
		"Вычесть",
		"Выполняет вычитание",
		СхемаВходныхПараметров(),
		Новый ОписаниеОповещения("Вычесть", ЭтотОбъект)),
		"Демо обработка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПанельУправления(Команда)
	ОткрытьФорму("ОбщаяФорма.Мсп_УправлениеMCP");
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьСервер(Команда)
	
	Мсп_Сервер.ЗапуститьСервер(9874);
	
КонецПроцедуры
#КонецОбласти

#Область Инструменты
&НаКлиенте
Функция Сложить(Запрос, ДополнительныеПараметры = Неопределено) Экспорт
	Возврат Запрос.Аргументы.a + Запрос.Аргументы.b;
КонецФункции

&НаКлиенте
Функция Вычесть(Запрос, ДополнительныеПараметры = Неопределено) Экспорт
	Возврат Запрос.Аргументы.a - Запрос.Аргументы.b;
КонецФункции

// Возвращает JSON-схему входных параметров запуска.
&НаКлиенте
Функция СхемаВходныхПараметров()
	Свойства = Новый Структура;
	Свойства.Вставить("a", Мсп_СхемаПараметров.НовыйСвойствоСхемы("number", "Операнд 1"));
	Свойства.Вставить("b", Мсп_СхемаПараметров.НовыйСвойствоСхемы("number", "Операнд 2"));
	Возврат Мсп_СхемаПараметров.НовыйСхемаОбъекта(Свойства);
КонецФункции

#КонецОбласти
