
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СписокВыбораЭлемента = Элементы.СписокВыбора.СписокВыбора;
	СписокВыбораЭлемента.Очистить();
	СписокВыбораЭлемента.Добавить("Значение1", "Значение 1");
	СписокВыбораЭлемента.Добавить("Значение2", "Значение 2");
	СписокВыбораЭлемента.Добавить("Значение3", "Значение 3");
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВыполнитьДействие(Команда)
	ТекстРезультата = "Кнопка нажата";
КонецПроцедуры

&НаКлиенте
Процедура СкрытьПоказатьПоле(Команда)
	Элементы.СкрываемоеПоле.Видимость = НЕ Элементы.СкрываемоеПоле.Видимость;
КонецПроцедуры

#КонецОбласти
