#Область ПрограммныйИнтерфейс

// Делает паузу для polling-операций test_client.
Процедура СделатьПаузу(Знач Интервал) Экспорт
	ТекущийСеансИнформационнойБазы = ПолучитьТекущийСеансИнформационнойБазы();
	ФоновоеЗадание = ТекущийСеансИнформационнойБазы.ПолучитьФоновоеЗадание();

	Если ФоновоеЗадание = Неопределено Тогда
		Параметры = Новый Массив;
		Параметры.Добавить(Интервал);
		ФоновоеЗадание = ФоновыеЗадания.Выполнить("Мсп_ПаузаТестКлиент.СделатьПаузу", Параметры);
	КонецЕсли;

	Попытка
		ФоновоеЗадание.ОжидатьЗавершения(Интервал);
	Исключение
		Возврат;
	КонецПопытки;
КонецПроцедуры

#КонецОбласти
