#Область ПрограммныйИнтерфейс

Асинх Функция ЗапуститьСервер(Порт, Параметры = Неопределено) Экспорт
	Возврат Ждать мсп_СерверКлиент.ЗапуститьСервер(Порт, Параметры);
КонецФункции

Процедура ОстановитьСервер() Экспорт
	мсп_СерверКлиент.ОстановитьСервер();
КонецПроцедуры

Процедура ЗарегистрироватьИнструмент(Имя, Описание, СхемаJSON, Оповещение) Экспорт
	мсп_ИнструментыКлиент.MCP_ЗарегистрироватьИнструмент(Имя, Описание, СхемаJSON, Оповещение);
КонецПроцедуры

Процедура ЗарегистрироватьРесурс(URI, Описание, MimeType, Оповещение) Экспорт
	мсп_ИнструментыКлиент.MCP_ЗарегистрироватьРесурс(URI, Описание, MimeType, Оповещение);
КонецПроцедуры

Процедура ЗарегистрироватьПромпт(Имя, Описание, Аргументы, Оповещение) Экспорт
	мсп_ИнструментыКлиент.MCP_ЗарегистрироватьПромпт(Имя, Описание, Аргументы, Оповещение);
КонецПроцедуры

Процедура ЛогСообщение(Уровень, Текст, Контекст = Неопределено) Экспорт
	мсп_ИнструментыКлиент.MCP_ЛогСообщение(Уровень, Текст, Контекст);
КонецПроцедуры

#КонецОбласти
