#Область ПрограммныйИнтерфейс

// Получает свойство из структуры/соответствия с поддержкой значения по умолчанию.
//
// Параметры:
//  Данные - Структура - Структура или соответствие.
//  Имя - Строка - Имя свойства.
//  ЗначениеПоУмолчанию - Произвольный, Неопределено - Значение по умолчанию.
//
// Возвращаемое значение:
//  Произвольный - Значение свойства или значение по умолчанию.
//  Неопределено - Свойство не найдено и значение по умолчанию не задано.
Функция Свойство(Данные, Имя, ЗначениеПоУмолчанию = Неопределено) Экспорт
	Если ТипЗнч(Данные) = Тип("Структура") Тогда
		Значение = ЗначениеПоУмолчанию;
		Если Данные.Свойство(Имя, Значение) Тогда
			Возврат Значение;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Данные) = Тип("Соответствие") Тогда
		Значение = Данные.Получить(Имя);
		Если Значение <> Неопределено Тогда
			Возврат Значение;
		КонецЕсли;
	КонецЕсли;
	
	Возврат ЗначениеПоУмолчанию;
КонецФункции

Функция ЗначенияВМассиве(Значение1,
						Значение2 = Неопределено,
						Значение3 = Неопределено,
						Значение4 = Неопределено,
						Значение5 = Неопределено,
						Значение6 = Неопределено,
						Значение7 = Неопределено,
						Значение8 = Неопределено,
						Значение9 = Неопределено,
						Значение10 = Неопределено) Экспорт
	
	ФлагПустогоЗначения = Неопределено;
	
	Значения = Новый Массив(10);
	Значения[0] = Значение1;
	Значения[1] = Значение2;
	Значения[2] = Значение3;
	Значения[3] = Значение4;
	Значения[4] = Значение5;
	Значения[5] = Значение6;
	Значения[6] = Значение7;
	Значения[7] = Значение8;
	Значения[8] = Значение9;
	Значения[9] = Значение10;
	
	Результат = Новый Массив;
	
	Для Инд = -9 По 0 Цикл
		Если Значения[-Инд] <> ФлагПустогоЗначения Тогда
			Результат = Новый Массив(1 - Инд);
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Для Инд = 0 По Результат.ВГраница() Цикл
		Результат[Инд] = Значения[Инд];
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
