//©///////////////////////////////////////////////////////////////////////////©//
//
//  Copyright 2021-2025 BIA-Technologies Limited Liability Company
//
//  Licensed under the Apache License, Version 2.0 (the "License");
//  you may not use this file except in compliance with the License.
//  You may obtain a copy of the License at
//
//      http://www.apache.org/licenses/LICENSE-2.0
//
//  Unless required by applicable law or agreed to in writing, software
//  distributed under the License is distributed on an "AS IS" BASIS,
//  WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
//  See the License for the specific language governing permissions and
//  limitations under the License.
//
//©///////////////////////////////////////////////////////////////////////////©//

#Область ПрограммныйИнтерфейс

// Возвращает случайный товар.
//
// Возвращаемое значение:
//	Строка - Случайное наименование товара.
//
// Пример:
//  СлучайныйТовар = ЮТПодражатель_Коммерция.Товар();
Функция Товар() Экспорт
	
	Словарь = СловарьТовары();
	
	Возврат ЮТПодражательСлужебный.СлучайноеЗначениеИзСловаря(Словарь);
	
КонецФункции

// Возвращает случайную категорию товара.
//
// Возвращаемое значение:
//	Строка - Случайное наименование категории.
//
// Пример:
//  СлучайнаяКатегория = ЮТПодражатель_Коммерция.Категория();
Функция Категория() Экспорт
	
	Словарь = СловарьКатегории();
	
	Возврат ЮТПодражательСлужебный.СлучайноеЗначениеИзСловаря(Словарь);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ИмяРеализации()
	Возврат "Коммерция";
КонецФункции

Функция СловарьТовары()
	Возврат ЮТПодражательСлужебный.Словарь(ИмяРеализации(), "Товары");
КонецФункции

Функция СловарьКатегории()
	Возврат ЮТПодражательСлужебный.Словарь(ИмяРеализации(), "Категории");
КонецФункции

#КонецОбласти
